leitek/sw/houyi/keil/stm32f103/Utilities/LCD/LTK_LCD_ST.c
/**
  ******************************************************************************
  * @file    LTK_LCD_ST.c
  * @author  leitek (leitek.taobao.com)
  * @version V1.0.0
  * @brief   LTK middleware. 
  *          This file provides LCD middleware functions.
  ******************************************************************************
  * @copy
  *
  * For non-commercial research and private study only.
  *
  * COPYRIGHT leitek.taobao.com
  */ 
  
/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "LTK_LCD_ST.h"
#include "LTK_SysTick.h"
#include "LTK_Retarget.h"
#include "LTK_Font.h"
#include "LTK_GPIO.h"
#include "LTK_RCC.h"
#include <string.h>

/** @addtogroup Utilities
  * @{
  */ 

/** @addtogroup LTK_LCD_ST
  * @{
  */ 

/** @defgroup LTK_LCD_ST_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */

/** @defgroup LTK_LCD_ST_Private_Defines
  * @{
  */

#define LTK_LCD_CS_SET()  GPIOD->BSRR = GPIO_Pin_2    /* chip select pin */
#define LTK_LCD_RD_SET()  GPIOC->BSRR = GPIO_Pin_10   /* register select pin */
#define LTK_LCD_WR_SET()  GPIOC->BSRR = GPIO_Pin_11   /* read strobe signal, low active */ 
#define LTK_LCD_RS_SET()  GPIOC->BSRR = GPIO_Pin_12   /* write strobe signal, low active */

#define LTK_LCD_CS_RESET()  GPIOD->BRR = GPIO_Pin_2     
#define LTK_LCD_RD_RESET()  GPIOC->BRR = GPIO_Pin_10       
#define LTK_LCD_WR_RESET()  GPIOC->BRR = GPIO_Pin_11   
#define LTK_LCD_RS_RESET()  GPIOC->BRR = GPIO_Pin_12     

#define LTK_LCD_BL_RESET() GPIO_ResetBits(GPIOC, GPIO_Pin_5)
#define LTK_LCD_BL_SET()   GPIO_SetBits(GPIOC, GPIO_Pin_5)


/**
  * @}
  */ 

/** @defgroup LTK_LCD_ST_Private_Macros
  * @{
  */ 

/**
  * @}
  */ 

/** @defgroup LTK_LCD_ST_Private_Variables
  * @{
  */
static LTK_LCD_Params LTK_LCD_Param;
static LTK_LCD_Struct_Font LTK_LCD_Font;
/* Global variables to handle the right font */

uint16_t LCD_Height = 240;
uint16_t LCD_Width  = 320;
 
/**
  * @}
  */

/** @defgroup LTK_LCD_ST_Private_FunctionPrototypes
  * @{
  */

/**
  * @}
  */

/** @defgroup LTK_LCD_ST_Private_Functions
  * @{
  */

/**
  * @brief  get the pointer to the LCD parameters.
  * @param  None
  * @retval the pointer to the LCD parameters
  */
LTK_LCD_Params *LTK_LCD_get_param(void)
{
    return &LTK_LCD_Param;
}

LTK_LCD_Struct_Font *LTK_LCD_get_Font(void)
{
    return &LTK_LCD_Font;
}

/**
  * @brief  initialize the LCD parameters struct.
  * @param  None
  * @retval None
  */
void LTK_LCD_Struct_Init(void)
{
    LTK_LCD_Struct_Font *lcd_font;
    lcd_font = LTK_LCD_get_Font();
        
    LTK_LCD_Param.LCD_Type = LCD_OTHER;
    LTK_LCD_Param.LCD_BusType = LCD_PARELLEL;
    LTK_LCD_Param.LCD_Text = "";

    lcd_font->LCD_Font = LCD_FONT_BIG;
    lcd_font->LCD_Font_Color = LCD_COLOR_WHITE;
}
  
/**
  * @brief  write index register.
  * @param  irData, the index register value to be written.
  * @retval None
  */
void LTK_LCD_WriteRegIndex(uint16_t irData)
{
    LTK_LCD_RS_RESET(); 
    LTK_LCD_CS_RESET(); 
    GPIO_Write(GPIOB, irData); 
    LTK_LCD_WR_RESET(); 
    LTK_LCD_WR_SET(); 
    LTK_LCD_CS_SET();
}

/**
  * @brief  write data.
  * @param  Data, the data to be written.
  * @retval None
  */
void LTK_LCD_WriteRAM(uint16_t Data)
{
    LTK_LCD_RS_SET(); 
    LTK_LCD_CS_RESET(); 
    GPIO_Write(GPIOB, Data); 
    LTK_LCD_WR_RESET();
    LTK_LCD_WR_SET(); 
    LTK_LCD_CS_SET();
}

/**
  * @brief  read data.
  * @param  None.
  * @retval Value read from LCD.
  */
uint16_t LTK_LCD_RD_DATA(void)
{
    uint16_t value;

    LTK_LCD_RS_SET();
    LTK_LCD_CS_RESET();
    LTK_LCD_RD_RESET();
    __NOP();
    __NOP();
    /* LTK_SysTick_Delay(5); */ /* delay 5us */
    LTK_LCD_RD_SET();
    
    value = GPIOB->IDR;
    LTK_LCD_CS_SET();
    return value; 
}

/**
  * @brief  Read LCD register.
  * @param  LCD_Reg, the register index to be read.
  * @retval value read from LCD.
  */
uint16_t LTK_LCD_ReadReg(uint16_t LCD_Reg)
{    
    uint16_t value;    
    GPIO_InitTypeDef GPIO_InitStructure;
    
    LTK_LCD_WriteRegIndex(LCD_Reg);  /* register index to be write */ 

    /* Configure port B as pull-up input */
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_All;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    /* no need to read twice since it is not from GRAM */
    value = LTK_LCD_RD_DATA();
    
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
    return value;  
}  

/**
  * @brief  Write LCD register.
  * @param  LCD_Reg, the register index to be written.
  * @param  LCD_RegValue, value to be written.
  * @retval None.
  */
void LTK_LCD_WriteReg(uint16_t LCD_Reg, uint16_t LCD_RegValue)
{
    LTK_LCD_WriteRegIndex(LCD_Reg); 
    LTK_LCD_WriteRAM(LCD_RegValue); 
} 

/**
  * @brief  Prepare to write to the LCD RAM.
  * @param  None
  * @retval None
  */
void LTK_LCD_WriteRAM_Prepare(void)
{
    LTK_LCD_WriteRegIndex(LCD_REG_22H);
}

/**
  * @brief  Writes 1 word to the LCD RAM.
  * @param  RGB_Code: the pixel color in RGB mode (5-6-5).
  * @retval None
  */
void LTK_LCD_WriteRAMWord(uint16_t RGB_Code)
{
    LTK_LCD_WriteRAM_Prepare();
    LTK_LCD_WriteRAM(RGB_Code);
}

/**
  * @brief  Reads the LCD RAM.
  * @param  None
  * @retval uint16_t - LCD RAM Value.
  */
uint16_t LTK_LCD_ReadRAM(void)
{
    return LTK_LCD_ReadReg(LCD_REG_16H);
}

/**
  * @brief  Enables the Display.
  * @param  None
  * @retval None
  */
void LTK_LCD_DisplayOn(void)
{  
}


/**
  * @brief  Disables the Display.
  * @param  None
  * @retval None
  */
void LTK_LCD_DisplayOff(void)
{
}

/**
  * @brief  Sets the background color.
  * @param  Color: specifies the background color code RGB(5-6-5).
  * @retval None
  */
void LTK_LCD_SetBackColor(uint16_t Color)
{
    LTK_LCD_Struct_Font *lcd_font;
    lcd_font = LTK_LCD_get_Font();
    lcd_font->LCD_Background_color = Color;
}

/**
  * @brief  Sets the Text color.
  * @param  Color: specifies the Text color code RGB(5-6-5).
  * @retval None
  */
void LTK_LCD_SetTextColor(uint16_t Color)
{
    LTK_LCD_Struct_Font *lcd_font;
    lcd_font = LTK_LCD_get_Font();
    lcd_font->LCD_Font_Color = Color;
}

/**
  * @brief  get the font color.
  * @param  None
  * @retval the font color
  */
uint16_t LTK_LCD_GetTextColor(void)
{
    return LTK_LCD_Font.LCD_Font_Color;
}

/**
  * @brief  Clear the screen.
  * @param  Color, color to be filled.
  * @retval None
  */
void LTK_LCD_Clear(uint16_t Color)
{
    uint32_t index = 0;      
    LTK_LCD_SetCursor(0x00,0x0000);
    LTK_LCD_WriteRAM_Prepare();
    for(index = 0; index < LCD_Height * LCD_Width; index++)
    {
        LTK_LCD_WriteRAM(Color);    
    }
}

/**
  * @brief  Sets the cursor position.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position. 
  * @retval None
  */
__inline void LTK_LCD_SetCursor(uint16_t x, uint16_t y)
{
    if(LTK_LCD_Param.LCD_Type == LCD_HX8347A)
    {
        LTK_LCD_WriteReg(LCD_REG_03H, x & 0xff);
        LTK_LCD_WriteReg(LCD_REG_02H, (x >> 8) & 0xff);
        LTK_LCD_WriteReg(LCD_REG_07H, y & 0xff);
        LTK_LCD_WriteReg(LCD_REG_06H, (y >> 8) & 0xff);
    }
    else
    {
        LTK_LCD_WriteReg(LCD_REG_20H, x);
        LTK_LCD_WriteReg(LCD_REG_21H, y);
    }
}

/**
  * @brief  Draws a character on LCD without background.
  * @param  Xpos: the Line where to display the character shape.
  *         This parameter can be one of the following values:
  * @param  Ypos: start column address.
  * @param  c: pointer to the character data.
  * @retval None
  */
void LTK_LCD_DrawCharTransparent(uint16_t Xpos, uint16_t Ypos, const uint16_t *c) /* 16bit char */
{
    LTK_LCD_Struct_Font *lcd_font;
    uint32_t line_index = 0, pixel_index = 0;
    uint8_t Xaddress = 0;
    uint16_t Yaddress = 0;

    lcd_font = LTK_LCD_get_Font();
    Xaddress = Xpos;
    Yaddress = Ypos;

