leitek/sw/houyi/keil/stm32f103/Utilities/LCD/LTK_LCD_ST.c
    for (line_index = 0; line_index < lcd_font->LCD_FontHeight; line_index++)
    {
        for (pixel_index = 0; pixel_index < lcd_font->LCD_FontWidth; pixel_index++)
        {
            /* SmallFonts have bytes in reverse order */
            if (( lcd_font->LCD_Font == LCD_FONT_BIG   && (((const uint16_t*)c)[line_index] & (1 << pixel_index)) == 0x00) ||
                ( lcd_font->LCD_Font == LCD_FONT_SMALL && (((const uint16_t*)c)[line_index] & (0x80 >> pixel_index)) == 0x00))
            {
                Yaddress--;
            }
            else
            {
                LTK_LCD_PutPixel(Xaddress, Yaddress--, lcd_font->LCD_Font_Color, SinglePixel);
            }
        }
        Xaddress++;
        Yaddress = Ypos;
    }
}

/**
  * @brief  Displays a maximum of 20 char on the LCD.
  * @param  Line: the Line where to display the character shape.
  * @param  *ptr: pointer to the string to display on LCD.
  * @retval None
  */
void LTK_LCD_DisplayAdjStringLine(uint16_t Line, uint16_t Column, uint8_t *ptr, GL_bool Transparent_Flag)
{
    LTK_LCD_Struct_Font *lcd_font;
    uint32_t index = 0;
    uint32_t iMaxChar;
    lcd_font = LTK_LCD_get_Font();
    iMaxChar = (Column / (lcd_font->LCD_FontWidth - 1));

    /* Send the string character by character on lCD */
    while ((*ptr != 0) & (index < iMaxChar))
    { /* Display one character on LCD */
        LTK_LCD_DisplayChar(Line, Column, *ptr, Transparent_Flag);
        /* Decrement the column position by GL_FontWidth */
        if ( *ptr == 'A' || *ptr == 'G' || *ptr == 'M' || *ptr == 'O' || *ptr == 'Q' || *ptr == 'X' || *ptr == 'm')
            Column -= (lcd_font->LCD_FontWidth);
        else
            Column -= (lcd_font->LCD_FontWidth - 1);
        /* Point on the next character */
        ptr++;
        /* Increment the character counter */
        index++;
    }
}

/**
  * @brief  Displays one character (16dots width, 24dots height).
  * @param  Line: the Line where to display the character shape.
  *         This parameter can be one of the following values:
  *     @arg  - Linex: where x can be 0..9
  * @param  Column: start column address.
  * @param  Ascii: character ascii code, must be between 0x20 and 0x7E.
  * @param  GL_bool Trasparent_Flag, if TRUE it does not print the GL_BackColor
  * @retval None
  */
void LTK_LCD_DisplayChar(uint16_t Line, uint16_t Column, uint8_t Ascii, GL_bool Transparent_Flag)
{
    
    LTK_LCD_Struct_Font *lcd_font;
    lcd_font = LTK_LCD_get_Font();
    Ascii -= 32;
    switch (lcd_font->LCD_Font)
    {
        case LCD_FONT_BIG:
            if (Transparent_Flag)
                LTK_LCD_DrawCharTransparent(Line, Column, &GL_Font16x24.table[Ascii * lcd_font->LCD_FontHeight] );
            else
                LTK_LCD_DrawChar(Line, Column, (&GL_Font16x24.table[Ascii * lcd_font->LCD_FontHeight]));
            break;

        case LCD_FONT_SMALL:
            if (Transparent_Flag)
                LTK_LCD_DrawCharTransparent(Line, Column, &GL_Font8x12_bold.table[Ascii * lcd_font->LCD_FontHeight] );
            else
                LTK_LCD_DrawChar(Line, Column, &GL_Font8x12_bold.table[Ascii * lcd_font->LCD_FontHeight]);
            break;

        default:
            break;
    }
}

/**
  * @brief  Sets a display window
  * @param  Xpos: specifies the X buttom left position.
  * @param  Ypos: specifies the Y buttom left position.
  * @param  Height: display window height.
  * @param  Width: display window width.
  * @retval None
  */
__inline void LTK_LCD_SetDisplayWindow(uint8_t Xpos,uint16_t Ypos,uint8_t Height,uint16_t Width)
{
    
    if(LTK_LCD_Param.LCD_Type == LCD_HX8347A)
    {
        /* Horizontal GRAM Start Address */
        LTK_LCD_WriteReg(LCD_REG_03H, (Xpos - Height + 1) & 0xff);
        LTK_LCD_WriteReg(LCD_REG_02H, ((Xpos - Height + 1) >> 8) & 0xff);
        /* Horizontal GRAM End Address */
        LTK_LCD_WriteReg(LCD_REG_05H, Xpos & 0xff);
        LTK_LCD_WriteReg(LCD_REG_04H, (Xpos >> 8) & 0xff);
        /* Vertical GRAM Start Address */
        LTK_LCD_WriteReg(LCD_REG_07H, (Ypos - Width + 1) & 0xff);\
        LTK_LCD_WriteReg(LCD_REG_06H, ((Ypos - Width + 1) >> 8) & 0xff);
        /* Vertical GRAM End Address */
        LTK_LCD_WriteReg(LCD_REG_09H, Ypos & 0xff);
        LTK_LCD_WriteReg(LCD_REG_08H, (Ypos >> 8) & 0xff);
    }
    else
    {
        /* Horizontal GRAM Start Address */
        LTK_LCD_WriteReg(LCD_REG_50H, (Xpos - Height + 1));
        /* Horizontal GRAM End Address */
        LTK_LCD_WriteReg(LCD_REG_51H, Xpos);
        /* Vertical GRAM Start Address */
        LTK_LCD_WriteReg(LCD_REG_52H, (Ypos - Width + 1));
        /* Vertical GRAM End Address */
        LTK_LCD_WriteReg(LCD_REG_53H, Ypos);
        LTK_LCD_SetCursor(Xpos, Ypos);
    }
}


/**
  * @brief  Displays a line.
  * @param Xpos: specifies the X position.
  * @param Ypos: specifies the Y position.
  * @param Length: line length.
  * @param Direction: line direction.
  *   This parameter can be one of the following values: Vertical or Horizontal.
  * @retval None
  */
void LTK_LCD_DrawLine(uint8_t Xpos, uint16_t Ypos, uint16_t Length, uint8_t Direction)
{
    uint32_t i = 0;
    LTK_LCD_Struct_Font *lcd_font;
    lcd_font = LTK_LCD_get_Font();
    LTK_LCD_SetCursor(Xpos, Ypos);
    if(Direction == LCD_DIR_HORIZONTAL)
    {
        LTK_LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
        for(i = 0; i < Length; i++)
        {
            LCD_WriteRAM(lcd_font->LCD_Font_Color);
        }
    }
    else
    {
        for(i = 0; i < Length; i++)
        {
            LTK_LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
            LTK_LCD_WriteRAM(lcd_font->LCD_Font_Color);
            Xpos++;
            LTK_LCD_SetCursor(Xpos, Ypos);
        }
    }
}

/**
  * @brief  Displays a rectangle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Height: display rectangle height.
  * @param  Width: display rectangle width.
  * @retval None
  */
void LTK_LCD_DrawRect(uint8_t Xpos, uint16_t Ypos, uint8_t Height, uint16_t Width)
{
    LTK_LCD_DrawLine(Xpos, Ypos, Width, LCD_DIR_HORIZONTAL);
    LTK_LCD_DrawLine((Xpos + Height), Ypos, Width, LCD_DIR_HORIZONTAL);

    LTK_LCD_DrawLine(Xpos, Ypos, Height, LCD_DIR_VERTICAL);
    LTK_LCD_DrawLine(Xpos, (Ypos - Width + 1), Height, LCD_DIR_VERTICAL);
}

/**
  * @brief  Displays a circle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Radius: the radius size of the circle
  * @retval None
  */
void LTK_LCD_DrawCircle(uint8_t Xpos, uint16_t Ypos, uint16_t Radius)
{
    int32_t  D;/* Decision Variable */
    uint32_t  CurX;/* Current X Value */
    uint32_t  CurY;/* Current Y Value */
    LTK_LCD_Struct_Font *lcd_font;
    lcd_font = LTK_LCD_get_Font();
    D = 3 - (Radius << 1);
    CurX = 0;
    CurY = Radius;

    while (CurX <= CurY)
    {
        LTK_LCD_SetCursor(Xpos + CurX, Ypos + CurY);
        LTK_LCD_WriteRAMWord(lcd_font->LCD_Font_Color);

        LTK_LCD_SetCursor(Xpos + CurX, Ypos - CurY);
        LTK_LCD_WriteRAMWord(lcd_font->LCD_Font_Color);

        LTK_LCD_SetCursor(Xpos - CurX, Ypos + CurY);
        LTK_LCD_WriteRAMWord(lcd_font->LCD_Font_Color);

