leitek/sw/houyi/keil/stm32f103/Utilities/LCD/LTK_LCD_ST.c
        LTK_LCD_SetCursor(Xpos - CurX, Ypos - CurY);
        LTK_LCD_WriteRAMWord(lcd_font->LCD_Font_Color);

        LTK_LCD_SetCursor(Xpos + CurY, Ypos + CurX);
        LTK_LCD_WriteRAMWord(lcd_font->LCD_Font_Color);

        LTK_LCD_SetCursor(Xpos + CurY, Ypos - CurX);
        LTK_LCD_WriteRAMWord(lcd_font->LCD_Font_Color);

        LTK_LCD_SetCursor(Xpos - CurY, Ypos + CurX);
        LTK_LCD_WriteRAMWord(lcd_font->LCD_Font_Color);

        LTK_LCD_SetCursor(Xpos - CurY, Ypos - CurX);
        LTK_LCD_WriteRAMWord(lcd_font->LCD_Font_Color);

        if (D < 0)
        {
            D += (CurX << 2) + 6;
        }
        else
        {
            D += ((CurX - CurY) << 2) + 10;
            CurY--;
        }
        CurX++;
    }
}

/**
  * @brief  Copy 4 bytes from bitmap array to 32Bit buffer
  * @param  ptrBitmap - Bitmap pointer
  * @param  ptr32BitBuffer - 32Bit buffer to fill
  * @retval None
  */
void BmpBuffer32BitRead(uint32_t* ptr32BitBuffer, uint8_t* ptrBitmap)
{
    *ptr32BitBuffer = 0;
    *ptr32BitBuffer = (*ptrBitmap);
    *ptr32BitBuffer += (*(ptrBitmap + 1)) << 8;
    *ptr32BitBuffer += (*(ptrBitmap + 2)) << 16;
    *ptr32BitBuffer += (*(ptrBitmap + 3)) << 24;
}

/**
  * @brief  Displays a bitmap picture
  * @param  BmpAddress: Bmp picture address
  * @retval None
  */
void LTK_LCD_DrawBMP(uint8_t* ptrBitmap)
{
    uint32_t uDataAddr = 0, uBmpSize = 0;
    uint16_t uBmpData;

    BmpBuffer32BitRead(&uBmpSize, ptrBitmap + 2);
    BmpBuffer32BitRead(&uDataAddr, ptrBitmap + 10);

    if(LTK_LCD_Param.LCD_Type == LCD_HX8347A)
    {
        LTK_LCD_WriteReg(LCD_REG_16H, 0x0048);
    }
    else
    {
        LTK_LCD_WriteReg(LCD_REG_03H, 0x1008);
    }
    LTK_LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */

    /* Read bitmap data and write them to LCD */
    for (; uDataAddr < uBmpSize; uDataAddr += 2)
    {
        uBmpData = (uint16_t)(*(ptrBitmap + uDataAddr)) + (uint16_t)((*(ptrBitmap + uDataAddr + 1)) << 8);
        LTK_LCD_WriteRAM( uBmpData );
    }

    
    if(LTK_LCD_Param.LCD_Type == LCD_HX8347A)
    {
        LTK_LCD_WriteReg(LCD_REG_16H, 0x00C8);
    }
    else
    {
        LTK_LCD_WriteReg(LCD_REG_03H, 0x1018);
    }
}

/**
  * @brief  Sets the Font (Big or Small).
  * @param  uFont: specifies the Font (GL_FONT_BIG or GL_FONT_SMALL).
  * @retval None
  */
void LTK_LCD_SetFont(uint8_t uFont)
{
    LTK_LCD_Struct_Font *lcd_font;
    lcd_font = LTK_LCD_get_Font();
    
    lcd_font->LCD_Font = (LTK_LCD_FONT_SIZE_TYPE) uFont;
    switch (lcd_font->LCD_Font)
    {
        case LCD_FONT_BIG:
            lcd_font->LCD_FontWidth = GL_FONT_BIG_WIDTH;
            lcd_font->LCD_FontHeight = GL_FONT_BIG_HEIGHT;
            break;

        case LCD_FONT_SMALL:
            lcd_font->LCD_FontWidth  = GL_FONT_SMALL_WIDTH;
            lcd_font->LCD_FontHeight = GL_FONT_SMALL_HEIGHT;
            break;

        default:
            break;
    } /* End switch */
}

/**
  * @brief  Switches the backlight either ON or OFF
  * @param  state. This parameter can be one of the following values:
  *     @arg   LCD_BACKLIGHT_ON
  *     @arg   LCD_BACKLIGHT_OFF
  * @retval None
  */
void LTK_LCD_BackLightSwitch(uint8_t Backlight_State)
{
    if (Backlight_State == LCD_BACKLIGHT_OFF)
    { /* Turning OFF the LCD Backlight */
        LTK_LCD_BL_SET();
        LTK_LCD_DisplayOff();
    }
    else if (Backlight_State == LCD_BACKLIGHT_ON)
    { /* Turning ON the LCD Backlight */
        LTK_LCD_BL_RESET();
        LTK_LCD_DisplayOn();
    }
}

/**
  * @brief  Disables LCD Window mode.
  * @param  None
  * @retval None
  */
void LTK_LCD_WindowModeDisable(void)
{
      LTK_LCD_SetDisplayWindow(239, 0x13F, 240, 320);
}

/**
  * @brief  Draw one pixel at position given by Xpos, Ypos of color Color.
  *     Three different modes are specified by PixelSpec in order to save time:
  *     1.FirstPixel, MiddlePixel and LasPixel are used for fastened block-writing
  *       to GRAM (for instance: drawing rectangle, horizontal line etc.)
  *     2.SinglePixel is used for drawing stand-alone pixel. (for instance:
  *       drawing circle, character etc.).
  * @param  Xpos: specifies X position
  * @param  Ypos: specifies Y position
  * @param  Color: RGB color of point
  * @param  PixelSpec: specifies Mode of putting pixel.
  *         This parameter can be one of the following values:
  *     @arg  - FirstPixel:  Starting pixel of block-writing sequence.
  *     @arg  - MiddlePixel: Middle-located pixel of block-writing sequence.
  *     @arg  - LasPixel:    Ending pixel of block-writing sequence
  *     @arg  - SinglePixel: Separated pixel.
  * @retval None
  */
void LTK_LCD_PutPixel(uint16_t Xpos, uint16_t Ypos, uint16_t Color, uint8_t PixelSpec)
{
    /*Start part of put pixel for first pixel of block and for single one.
    It consists of set the cursor's position and GRAM prepare sequence.*/
    if (PixelSpec & (LCD_FirstPixel | LCD_SinglePixel))
    {
        LTK_LCD_SetCursor(Xpos, Ypos);
        LTK_LCD_WriteRAM_Prepare();
    }

    /*Write pixel's color to GRAM. Obligatory for all modes of PutPixel call.*/
    LTK_LCD_WriteRAM(Color);
}

/**
  * @brief  Get color of pixel located at appropriate position
  * @param  Xpos: specifies X position
  * @param  Ypos: specifies Y position
  * @retval uint16_t - RGB color of required pixel.
  */
uint16_t LTK_LCD_GetPixel(uint16_t Xpos, uint16_t Ypos)
{
    uint16_t tmpColor = 0, tmpRed = 0, tmpBlue = 0;

    /*Read the color of given pixel*/
    LTK_LCD_SetCursor(Xpos, Ypos);

    tmpColor = LTK_LCD_ReadRAM();

    /*Swap the R and B color channels*/
    tmpRed = (tmpColor & LCD_COLOR_BLUE) << 11;
    tmpBlue = (tmpColor & LCD_COLOR_RED) >> 11;
    tmpColor &= ~(LCD_COLOR_RED | LCD_COLOR_BLUE);
    tmpColor |= (tmpRed | tmpBlue);

    return tmpColor;
}

/**
  * @brief  Draws a character on LCD.
  * @param  Xpos: the Line where to display the character shape.
  *         This parameter can be one of the following values:
  *     @arg  - Linex: where x can be 0..9
  * @param  Ypos: start column address.
  * @param  c: pointer to the character data.
  * @retval None
  */
void LTK_LCD_DrawChar(uint8_t Xpos, uint16_t Ypos, const uint16_t *c) /* 16bit char */
{
    uint32_t line_index = 0, pixel_index = 0;
    uint8_t Xaddress = 0;
    uint16_t Yaddress = 0;
    __IO uint16_t tmp_color = 0;
    LTK_LCD_Struct_Font *lcd_font;

    lcd_font = LTK_LCD_get_Font();

    Xaddress = Xpos;
    Yaddress = Ypos;

