leitek/sw/houyi/keil/stm32f103/Utilities/LCD/LTK_LCD_ST.c
    for (line_index = 0; line_index < lcd_font->LCD_FontHeight; line_index++)
    {
        /* SmallFonts have bytes in reverse order */
        if (( lcd_font->LCD_Font == LCD_FONT_BIG   && (((const uint16_t*)c)[line_index] & (1 << 0)) == 0x00) ||
        ( lcd_font->LCD_Font == LCD_FONT_SMALL && (((const uint16_t*)c)[line_index] & (0x80 >> 0)) == 0x00))
        {
            tmp_color = lcd_font->LCD_Background_color;
        }
        else
        {
            tmp_color = lcd_font->LCD_Font_Color;
        }

        LTK_LCD_PutPixel(Xaddress, Yaddress--, tmp_color, LCD_FirstPixel);

        for (pixel_index = 1; pixel_index < lcd_font->LCD_FontWidth - 1; pixel_index++)
        {
            /* SmallFonts have bytes in reverse order */
            if (( lcd_font->LCD_Font == LCD_FONT_BIG   && (((const uint16_t*)c)[line_index] & (1 << pixel_index)) == 0x00) ||
            ( lcd_font->LCD_Font == LCD_FONT_SMALL && (((const uint16_t*)c)[line_index] & (0x80 >> pixel_index)) == 0x00))
            {
                tmp_color = lcd_font->LCD_Background_color;
            }
            else
            {
                tmp_color = lcd_font->LCD_Font_Color;
            }

            LTK_LCD_PutPixel(Xaddress, Yaddress--, tmp_color, LCD_MiddlePixel);
        }
        pixel_index++;
        /* SmallFonts have bytes in reverse order */
        if (( lcd_font->LCD_Font == LCD_FONT_BIG   && (((const uint16_t*)c)[line_index] & (1 << pixel_index)) == 0x00) ||
        ( lcd_font->LCD_Font == LCD_FONT_SMALL && (((const uint16_t*)c)[line_index] & (0x80 >> pixel_index)) == 0x00))
        {
            tmp_color = lcd_font->LCD_Background_color;
        }
        else
        {
            tmp_color = lcd_font->LCD_Font_Color;
        }

        LTK_LCD_PutPixel(Xaddress, Yaddress--, tmp_color, LCD_LastPixel);

        Xaddress++;
        Yaddress = Ypos;
    }
}

/**
  * @brief  LCD_Change_Direction
  * @param  RCC_APBPeriph: specifies the APB peripheral to gates its clock.
  * @param  Direction: The Drawing Direction
  *         This parameter can be one of the following values:
  *     @arg  _0_degree
  *     @arg  _90_degree
  *     @arg  _180_degree
  *     @arg  _270_degree
  * @retval None
  */
void LTK_LCD_Change_Direction(LCD_Direction_TypeDef Direction)
{
    LTK_LCD_Struct_Font *lcd_font;
    lcd_font = LTK_LCD_get_Font();

    lcd_font->LCD_Direction = Direction;
    if(LTK_LCD_Param.LCD_Type == LCD_HX8347A)
    {
        if (lcd_font->LCD_Direction == _0_degree)
        {
            LTK_LCD_WriteReg(LCD_REG_16H, 0X00C8);
        }
        else if (lcd_font->LCD_Direction == _90_degree)
        {
            LTK_LCD_WriteReg(LCD_REG_16H, 0x00A8);
        }
        else if (lcd_font->LCD_Direction == _180_degree)
        {
            LTK_LCD_WriteReg(LCD_REG_16H, 0X0008);
        }
        else if (lcd_font->LCD_Direction == _270_degree)
        {
            LTK_LCD_WriteReg(LCD_REG_16H, 0x0068);
        }
    }
    else
    {
        if (lcd_font->LCD_Direction == _0_degree)
        {
            LTK_LCD_WriteReg(LCD_REG_03H, 0x1018);
        }
        else if (lcd_font->LCD_Direction == _90_degree)
        {
            LTK_LCD_WriteReg(LCD_REG_03H, 0x1030);
        }
        else if (lcd_font->LCD_Direction == _180_degree)
        {
            LTK_LCD_WriteReg(LCD_REG_03H, 0x1028);
        }
        else if (lcd_font->LCD_Direction == _270_degree)
        {
            LTK_LCD_WriteReg(LCD_REG_03H, 0x1000);
        }
    }
}

/**
  * @brief  LCD_WriteChar
  * @param  Xpos: The X axis position
  * @param  Ypos: The Y axis position
  * @param  *c:   The Character pointer
  * @retval None
  */
void LTK_LCD_WriteChar(uint16_t Xpos, uint16_t Ypos, const uint16_t *c)
{
    uint32_t index = 0, counter = 0;
    uint16_t Xaddress = 0;
    uint16_t Yaddress = 0;
    LTK_LCD_Struct_Font *lcd_font;
    lcd_font = LTK_LCD_get_Font();
    if ((lcd_font->LCD_Direction == _0_degree) || (lcd_font->LCD_Direction == _180_degree))
    {
        Xaddress = Xpos;
        LTK_LCD_SetCursor(Xaddress, Ypos);
    }
    else if ((lcd_font->LCD_Direction == _90_degree) || (lcd_font->LCD_Direction == _270_degree))
    {
        Yaddress = Ypos;
        LTK_LCD_SetCursor(Xpos, Yaddress);
    }

    for (index = 0; index < lcd_font->LCD_FontHeight; index++)
    {
        if ((LTK_LCD_Param.LCD_Type == LCD_ILI9320) ||
            (LTK_LCD_Param.LCD_Type == LCD_HX8347A))
        {
            LTK_LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
        }
        for (counter = 0; counter < lcd_font->LCD_FontWidth; counter++)
        {
            /* SmallFonts have bytes in reverse order */
            if (( lcd_font->LCD_Font == LCD_FONT_BIG   && (((const uint16_t*)c)[index] & (1 << counter)) == 0x00) ||
                ( lcd_font->LCD_Font == LCD_FONT_BIG && (c[index] & (0x80 >> counter)) == 0x00))
            {
                LTK_LCD_WriteRAM(lcd_font->LCD_Background_color);
            }
            else
            {
                LTK_LCD_WriteRAM(lcd_font->LCD_Font_Color);
            }
        }

        if (lcd_font->LCD_Direction == _0_degree)
        {
            Xaddress++;
            LTK_LCD_SetCursor(Xaddress, Ypos);
        }
        else if (lcd_font->LCD_Direction == _90_degree)
        {
            Yaddress++;
            LTK_LCD_SetCursor(Xpos, Yaddress);
        }
        else if (lcd_font->LCD_Direction == _180_degree)
        {
            Xaddress--;
            LTK_LCD_SetCursor(Xaddress, Ypos);
        }
        else if (lcd_font->LCD_Direction == _270_degree)
        {
            Yaddress--;
            LTK_LCD_SetCursor(Xpos, Yaddress);
        }
    }
}

/**
  * @brief  LCD_PrintChar
  * @param  Line:   The X axis position
  * @param  Column: The Y axis position
  * @param  Ascii:  The Character pointer
  * @retval None
  */
void LTK_LCD_PrintChar(uint16_t Line, uint16_t Column, uint8_t Ascii)
{
    LTK_LCD_Struct_Font *lcd_font;
    lcd_font = LTK_LCD_get_Font();
    Ascii -= 32;
    switch (lcd_font->LCD_Font)
    {
        case LCD_FONT_BIG:
            LTK_LCD_WriteChar( Line, Column, &GL_Font16x24.table[Ascii * lcd_font->LCD_FontHeight] );
            break;

