leitek/sw/houyi/keil/stm32f103/Utilities/LCD/LTK_LCD_ST.c
        case LCD_FONT_SMALL:
            LTK_LCD_WriteChar( Line, Column, &GL_Font8x12_bold.table[Ascii * lcd_font->LCD_FontHeight] );
            break;

        default:
            break;
    }
}

/**
  * @brief  LCD_PrintStringLine
  * @param  Line:   The X axis position
  * @param  Column: The Y axis position
  * @param  *ptr:  The String of characters to be printed
  * @retval None
  */
void LTK_LCD_PrintStringLine(uint16_t Line, uint16_t Column, uint8_t *ptr)
{
    uint32_t counter = 0;
    uint16_t refcolumn = 0;
    uint8_t max_char_line = 0;
    static uint16_t line;
    LTK_LCD_Struct_Font *lcd_font;

    lcd_font = LTK_LCD_get_Font();

    line = Line;

    if (lcd_font->LCD_Direction == _0_degree)
    {
        max_char_line = (LCD_Width / lcd_font->LCD_FontWidth);
        refcolumn = Column;
    }
    else if (lcd_font->LCD_Direction == _90_degree)
    {
        max_char_line = (LCD_Height / lcd_font->LCD_FontWidth);
        refcolumn = Column;
    }
    else if (lcd_font->LCD_Direction == _180_degree)
    {
        max_char_line = (LCD_Width / lcd_font->LCD_FontWidth);
        refcolumn = Column;
        line = LCD_Height - Line;
    }
    else if (lcd_font->LCD_Direction == _270_degree)
    {
        max_char_line = (LCD_Height / lcd_font->LCD_FontWidth);
        refcolumn = Column;
        line = LCD_Width - Line;
    }

    /* Send the string character by character on LCD */
    while ((*ptr != 0) & (counter < max_char_line))
    {
        if (lcd_font->LCD_Direction == _0_degree)
        {
            /* Display one character on LCD */
            LTK_LCD_PrintChar(line, refcolumn, *ptr);
            /* Decrement the column position by 16 */
            refcolumn -= lcd_font->LCD_FontWidth;
        }
        else if (lcd_font->LCD_Direction == _90_degree)
        {
            /* Display one character on LCD */
            LTK_LCD_PrintChar(refcolumn, line, *ptr);
            /* Increment the column position by 16 */
            refcolumn += lcd_font->LCD_FontWidth;
        }
        else if (lcd_font->LCD_Direction == _180_degree)
        {
            /* Display one character on LCD */
            LTK_LCD_PrintChar(line, refcolumn, *ptr);
            /* Decrement the column position by 16 */
            refcolumn += lcd_font->LCD_FontWidth;
        }
        else if (lcd_font->LCD_Direction == _270_degree)
        {
            /* Display one character on LCD */
            LTK_LCD_PrintChar(refcolumn, line, *ptr);
            /* Increment the column position by 16 */
            refcolumn -= lcd_font->LCD_FontWidth;
        }

        /* Point on the next character */
        ptr++;
        /* Increment the character counter */
        counter++;
    }
}

/**
  * @brief  LCD_DrawMonoBMP
  * @param  *Pict:   The pointer to the image
  * @param  Xpos_Init: The X axis position
  * @param  Ypos_Init: The Y axis position
  * @param  Height:    The Height of the image
  * @param  Width:     The Width of the image
  * @retval None
  */
void LTK_LCD_DrawMonoBMP(const uint8_t *Pict, uint16_t Xpos_Init, uint16_t Ypos_Init, uint16_t Height, uint16_t Width)
{
    int32_t index = 0, counter = 0;
    LTK_LCD_Struct_Font *lcd_font;
    lcd_font = LTK_LCD_get_Font();
    
    LTK_LCD_SetDisplayWindow(Xpos_Init + Height - 1, Ypos_Init + Width - 1, Height, Width);

    LTK_LCD_SetCursor(Xpos_Init, Ypos_Init);

    if ((LTK_LCD_Param.LCD_Type == LCD_ILI9320) ||
        (LTK_LCD_Param.LCD_Type == LCD_HX8347A))
    {
        /* Prepare to write GRAM */
        LTK_LCD_WriteRAM_Prepare(); 
    }

    for (index = 0; index < (Height*Width) / 8; index++)
    {
        for (counter = 7; counter >= 0; counter--)
        {
            if ((Pict[index] & (1 << counter)) == 0x00)
            {
                LTK_LCD_WriteRAM(lcd_font->LCD_Background_color);
            }
            else
            {
                LTK_LCD_WriteRAM(lcd_font->LCD_Font_Color);
            }
        }
    }

    LTK_LCD_Change_Direction(lcd_font->LCD_Direction);
    LTK_LCD_SetDisplayWindow(LCD_Height - 1, LCD_Width - 1, LCD_Height, LCD_Width);
}

/**
  * @brief  Fill area with color.
  * @param  maxX: Maximum X coordinate
  * @param  minX: Minimum X coordinate
  * @param  maxY: Maximum Y coordinate
  * @param  minY: Minimum Y coordinate
  * @param  ptrBitmap: pointer to the image
  * @retval None
  */
void LTK_LCD_FillArea(uint16_t Xpos_Init, uint16_t Ypos_Init, uint16_t Height, uint16_t Width, uint16_t color)
{
    uint32_t area = 0;
    uint32_t index = 0;
    LTK_LCD_Struct_Font *lcd_font;
    lcd_font = LTK_LCD_get_Font();
    area =  Width *  Height;

    LTK_LCD_SetCursor(Xpos_Init, Ypos_Init);

    if ((LTK_LCD_Param.LCD_Type == LCD_ILI9320) ||
        (LTK_LCD_Param.LCD_Type == LCD_HX8347A))
    {
        LTK_LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
    }

    for (index = 0;index < area; index++)
    {
        LTK_LCD_WriteRAM(color);
    }

    LTK_LCD_Change_Direction(lcd_font->LCD_Direction);
    LTK_LCD_SetDisplayWindow(LCD_Height - 1, LCD_Width - 1, LCD_Height, LCD_Width);
}

/**
  * @brief  LCD_DrawColorBMP
  * @param  *ptrBitmap:   The pointer to the image
  * @param  Xpos_Init: The X axis position
  * @param  Ypos_Init: The Y axis position
  * @param  Height:    The Height of the image
  * @param  Width:     The Width of the image
  * @retval None
  */
void LTK_LCD_DrawColorBMP(uint8_t* ptrBitmap, uint16_t Xpos_Init, uint16_t Ypos_Init, uint16_t Height, uint16_t Width)
{
    uint32_t uDataAddr = 0, uBmpSize = 0;
    uint16_t uBmpData = 0;
    LTK_LCD_Struct_Font *lcd_font;
    lcd_font = LTK_LCD_get_Font();
    BmpBuffer32BitRead(&uBmpSize, ptrBitmap + 2);  
    BmpBuffer32BitRead(&uDataAddr, ptrBitmap + 10);  

    LTK_LCD_SetCursor(Xpos_Init, Ypos_Init);

    if ((LTK_LCD_Param.LCD_Type == LCD_ILI9320) ||
        (LTK_LCD_Param.LCD_Type == LCD_HX8347A))
    {
        /* Prepare to write GRAM */
        LTK_LCD_WriteRAM_Prepare(); 
    }

    /* Read bitmap data and write them to LCD */
    for (; uDataAddr < uBmpSize; uDataAddr += 2)
    {
        uBmpData = (uint16_t)(*(ptrBitmap + uDataAddr)) + (uint16_t)((*(ptrBitmap + uDataAddr + 1)) << 8);
        LTK_LCD_WriteRAM( uBmpData );
    }

    LTK_LCD_Change_Direction(lcd_font->LCD_Direction);
    LTK_LCD_SetDisplayWindow(LCD_Height - 1, LCD_Width - 1, LCD_Height, LCD_Width);
}

/**
  * @brief  initialize panel.
  * @param  None.
  * @retval None
  */
void LTK_LGDP4531_Init(void)
{
    LTK_LCD_WriteReg(0X00,0X0001);
    LTK_SysTick_Delay(50);
    LTK_LCD_WriteReg(0X10,0X1628);   
    LTK_LCD_WriteReg(0X12,0X000e);  
    LTK_LCD_WriteReg(0X13,0X0A39);   
    LTK_SysTick_Delay(50);
    LTK_LCD_WriteReg(0X11,0X0040);   
    LTK_LCD_WriteReg(0X15,0X0050);   
    LTK_SysTick_Delay(50);
    LTK_LCD_WriteReg(0X12,0X001e);  
    LTK_SysTick_Delay(50);
    LTK_LCD_WriteReg(0X10,0X1620);   
    LTK_LCD_WriteReg(0X13,0X2A39);   
    LTK_SysTick_Delay(50);
    LTK_LCD_WriteReg(0X01,0X0100);   
    LTK_LCD_WriteReg(0X02,0X0300);   
    LTK_LCD_WriteReg(0X03,0X1030); 
    LTK_LCD_WriteReg(0X08,0X0202);   
    LTK_LCD_WriteReg(0X0A,0X0008);   
    LTK_LCD_WriteReg(0X30,0X0000);   
    LTK_LCD_WriteReg(0X31,0X0402);   
    LTK_LCD_WriteReg(0X32,0X0106);   
    LTK_LCD_WriteReg(0X33,0X0503);   
    LTK_LCD_WriteReg(0X34,0X0104);   
    LTK_LCD_WriteReg(0X35,0X0301);   
    LTK_LCD_WriteReg(0X36,0X0707);   
    LTK_LCD_WriteReg(0X37,0X0305);   
    LTK_LCD_WriteReg(0X38,0X0208);   
    LTK_LCD_WriteReg(0X39,0X0F0B);   
    LTK_LCD_WriteReg(0X41,0X0002);   
    LTK_LCD_WriteReg(0X60,0X2700);   
    LTK_LCD_WriteReg(0X61,0X0001);   
    LTK_LCD_WriteReg(0X90,0X0210);   
    LTK_LCD_WriteReg(0X92,0X010A);   
    LTK_LCD_WriteReg(0X93,0X0004);   
    LTK_LCD_WriteReg(0XA0,0X0100);   
    LTK_LCD_WriteReg(0X07,0X0001);   
    LTK_LCD_WriteReg(0X07,0X0021);   
    LTK_LCD_WriteReg(0X07,0X0023);   
    LTK_LCD_WriteReg(0X07,0X0033);   
    LTK_LCD_WriteReg(0X07,0X0133);   
    LTK_LCD_WriteReg(0XA0,0X0000); 
}

/**
  * @brief  initialize panel.
  * @param  None.
  * @retval None
  */
void LTK_ILI9325_Init(void)
{
    /* Start Initial Sequence ------------------------------------------------*/
    LTK_LCD_WriteReg(LCD_REG_00H, 0x0001); /* Start internal OSC. */
    LTK_LCD_WriteReg(LCD_REG_01H, 0x0100); /* Set SS and SM bit */
    LTK_LCD_WriteReg(LCD_REG_02H, 0x0700); /* Set 1 line inversion */
    LTK_LCD_WriteReg(LCD_REG_03H, 0x1018); /* Set GRAM write direction and BGR=1. */
    LTK_LCD_WriteReg(LCD_REG_04H, 0x0000); /* Resize register */
    LTK_LCD_WriteReg(LCD_REG_08H, 0x0202); /* Set the back porch and front porch */
    LTK_LCD_WriteReg(LCD_REG_09H, 0x0000); /* Set non-display area refresh cycle ISC[3:0] */
    LTK_LCD_WriteReg(LCD_REG_0AH, 0x0000); /* FMARK function */
    LTK_LCD_WriteReg(LCD_REG_0CH, 0x0000); /* RGB interface setting */
    LTK_LCD_WriteReg(LCD_REG_0DH, 0x0000); /* Frame marker Position */
    LTK_LCD_WriteReg(LCD_REG_0FH, 0x0000); /* RGB interface polarity */

