leitek/sw/houyi/keil/stm32f103/Utilities/LCD/LTK_LCD_ST.c
    /* Power On sequence -----------------------------------------------------*/
    LTK_LCD_WriteReg(LCD_REG_10H, 0x0000); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
    LTK_LCD_WriteReg(LCD_REG_11H, 0x0000); /* DC1[2:0], DC0[2:0], VC[2:0] */
    LTK_LCD_WriteReg(LCD_REG_12H, 0x0000); /* VREG1OUT voltage */
    LTK_LCD_WriteReg(LCD_REG_13H, 0x0000); /* VDV[4:0] for VCOM amplitude */
    LTK_SysTick_Delay(200);                      /* Dis-charge capacitor power voltage (200ms) */
    LTK_LCD_WriteReg(LCD_REG_10H, 0x17B0); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
    LTK_LCD_WriteReg(LCD_REG_11H, 0x0137); /* DC1[2:0], DC0[2:0], VC[2:0] */
    LTK_SysTick_Delay(50);                       /* Delay 50 ms */
    LTK_LCD_WriteReg(LCD_REG_12H, 0x0139); /* VREG1OUT voltage */
    LTK_SysTick_Delay(50);                       /* Delay 50 ms */
    LTK_LCD_WriteReg(LCD_REG_13H, 0x1d00); /* VDV[4:0] for VCOM amplitude */
    LTK_LCD_WriteReg(LCD_REG_29H, 0x0013); /* VCM[4:0] for VCOMH */
    LTK_SysTick_Delay(50);                       /* Delay 50 ms */
    LTK_LCD_WriteReg(LCD_REG_20H, 0x0000); /* GRAM horizontal Address */
    LTK_LCD_WriteReg(LCD_REG_21H, 0x0000); /* GRAM Vertical Address */

    /* Adjust the Gamma Curve (ILI9325)---------------------------------------*/
    LTK_LCD_WriteReg(LCD_REG_30H, 0x0007);
    LTK_LCD_WriteReg(LCD_REG_31H, 0x0302);
    LTK_LCD_WriteReg(LCD_REG_32H, 0x0105);
    LTK_LCD_WriteReg(LCD_REG_35H, 0x0206);
    LTK_LCD_WriteReg(LCD_REG_36H, 0x0808);
    LTK_LCD_WriteReg(LCD_REG_37H, 0x0206);
    LTK_LCD_WriteReg(LCD_REG_38H, 0x0504);
    LTK_LCD_WriteReg(LCD_REG_39H, 0x0007);
    LTK_LCD_WriteReg(LCD_REG_3CH, 0x0105);
    LTK_LCD_WriteReg(LCD_REG_3DH, 0x0808);

    /* Set GRAM area ---------------------------------------------------------*/
    LTK_LCD_WriteReg(LCD_REG_50H, 0x0000); /* Horizontal GRAM Start Address */
    LTK_LCD_WriteReg(LCD_REG_51H, 0x00EF); /* Horizontal GRAM End Address */
    LTK_LCD_WriteReg(LCD_REG_52H, 0x0000); /* Vertical GRAM Start Address */
    LTK_LCD_WriteReg(LCD_REG_53H, 0x013F); /* Vertical GRAM End Address */

    LTK_LCD_WriteReg(LCD_REG_60H,  0xA700); /* Gate Scan Line(GS=1, scan direction is G320~G1) */
    LTK_LCD_WriteReg(LCD_REG_61H,  0x0001); /* NDL,VLE, REV */
    LTK_LCD_WriteReg(LCD_REG_6AH, 0x0000); /* set scrolling line */

    /* Partial Display Control -----------------------------------------------*/
    LTK_LCD_WriteReg(LCD_REG_80H, 0x0000);
    LTK_LCD_WriteReg(LCD_REG_81H, 0x0000);
    LTK_LCD_WriteReg(LCD_REG_82H, 0x0000);
    LTK_LCD_WriteReg(LCD_REG_83H, 0x0000);
    LTK_LCD_WriteReg(LCD_REG_84H, 0x0000);
    LTK_LCD_WriteReg(LCD_REG_85H, 0x0000);

    /* Panel Control ---------------------------------------------------------*/
    LTK_LCD_WriteReg(LCD_REG_90H, 0x0010);
    LTK_LCD_WriteReg(LCD_REG_92H, 0x0000);
    LTK_LCD_WriteReg(LCD_REG_93H, 0x0003);
    LTK_LCD_WriteReg(LCD_REG_95H, 0x0110);
    LTK_LCD_WriteReg(LCD_REG_97H, 0x0000);
    LTK_LCD_WriteReg(LCD_REG_98H, 0x0000);

    /* set GRAM write direction and BGR = 1 */
    /* I/D=00 (Horizontal : increment, Vertical : decrement) */
    /* AM=1 (address is updated in vertical writing direction) */
    LTK_LCD_WriteReg(LCD_REG_03H, (1<<12)|(3<<4)|(0<<3));

    LTK_LCD_WriteReg(LCD_REG_07H, 0x0133); /* 262K color and display ON */
}

/**
  * @brief  initialize panel.
  * @param  None.
  * @retval None
  */
void LTK_ILI9320_Init(void)
{
    LTK_SysTick_Delay(50); /* Delay 50 ms */
    /* Start Initial Sequence ------------------------------------------------*/
    LTK_LCD_WriteReg(LCD_REG_E5H, 0x8000); /* Set the internal vcore voltage */
    LTK_LCD_WriteReg(LCD_REG_00H,  0x0001); /* Start internal OSC. */
    LTK_LCD_WriteReg(LCD_REG_01H,  0x0100); /* set SS and SM bit */
    LTK_LCD_WriteReg(LCD_REG_02H,  0x0700); /* set 1 line inversion */
    LTK_LCD_WriteReg(LCD_REG_03H,  (1<<12)|(3<<4)|(0<<3)); /* set GRAM write direction and BGR=1. */
    LTK_LCD_WriteReg(LCD_REG_04H,  0x0000); /* Resize register */
    LTK_LCD_WriteReg(LCD_REG_08H,  0x0202); /* set the back porch and front porch */
    LTK_LCD_WriteReg(LCD_REG_09H,  0x0000); /* set non-display area refresh cycle ISC[3:0] */
    LTK_LCD_WriteReg(LCD_REG_0AH, 0x0000); /* FMARK function */
    LTK_LCD_WriteReg(LCD_REG_0CH, 0x0000); /* RGB interface setting */
    LTK_LCD_WriteReg(LCD_REG_0DH, 0x0000); /* Frame marker Position */
    LTK_LCD_WriteReg(LCD_REG_0FH, 0x0000); /* RGB interface polarity */
    /* Power On sequence -----------------------------------------------------*/
    LTK_LCD_WriteReg(LCD_REG_10H, 0x0000); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
    LTK_LCD_WriteReg(LCD_REG_11H, 0x0000); /* DC1[2:0], DC0[2:0], VC[2:0] */
    LTK_LCD_WriteReg(LCD_REG_12H, 0x0000); /* VREG1OUT voltage */
    LTK_LCD_WriteReg(LCD_REG_13H, 0x0000); /* VDV[4:0] for VCOM amplitude */
    LTK_SysTick_Delay(200);                      /* Dis-charge capacitor power voltage (200ms) */
    LTK_LCD_WriteReg(LCD_REG_10H, 0x17B0); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
    LTK_LCD_WriteReg(LCD_REG_11H, 0x0137); /* DC1[2:0], DC0[2:0], VC[2:0] */
    LTK_SysTick_Delay(50);                       /* Delay 50 ms */
    LTK_LCD_WriteReg(LCD_REG_12H, 0x0139); /* VREG1OUT voltage */
    LTK_SysTick_Delay(50);                       /* Delay 50 ms */
    LTK_LCD_WriteReg(LCD_REG_13H, 0x1d00); /* VDV[4:0] for VCOM amplitude */
    LTK_LCD_WriteReg(LCD_REG_29H, 0x0013); /* VCM[4:0] for VCOMH */
    LTK_SysTick_Delay(50);                       /* Delay 50 ms */
    LTK_LCD_WriteReg(LCD_REG_20H, 0x0000); /* GRAM horizontal Address */
    LTK_LCD_WriteReg(LCD_REG_21H, 0x0000); /* GRAM Vertical Address */
    /* Adjust the Gamma Curve ------------------------------------------------*/
    LTK_LCD_WriteReg(LCD_REG_30H, 0x0006);
    LTK_LCD_WriteReg(LCD_REG_31H, 0x0101);
    LTK_LCD_WriteReg(LCD_REG_32H, 0x0003);
    LTK_LCD_WriteReg(LCD_REG_35H, 0x0106);
    LTK_LCD_WriteReg(LCD_REG_36H, 0x0b02);
    LTK_LCD_WriteReg(LCD_REG_37H, 0x0302);
    LTK_LCD_WriteReg(LCD_REG_38H, 0x0707);
    LTK_LCD_WriteReg(LCD_REG_39H, 0x0007);
    LTK_LCD_WriteReg(LCD_REG_3CH, 0x0600);
    LTK_LCD_WriteReg(LCD_REG_3DH, 0x020b);
  
