leitek/sw/houyi/keil/stm32f103/Utilities/LCD/LTK_LCD_ST.c
    /* Set GRAM area ---------------------------------------------------------*/
    LTK_LCD_WriteReg(LCD_REG_50H, 0x0000); /* Horizontal GRAM Start Address */
    LTK_LCD_WriteReg(LCD_REG_51H, 0x00EF); /* Horizontal GRAM End Address */
    LTK_LCD_WriteReg(LCD_REG_52H, 0x0000); /* Vertical GRAM Start Address */
    LTK_LCD_WriteReg(LCD_REG_53H, 0x013F); /* Vertical GRAM End Address */
    LTK_LCD_WriteReg(LCD_REG_60H,  0x2700); /* Gate Scan Line */
    LTK_LCD_WriteReg(LCD_REG_61H,  0x0001); /* NDL,VLE, REV */
    LTK_LCD_WriteReg(LCD_REG_6AH, 0x0000); /* set scrolling line */
    /* Partial Display Control -----------------------------------------------*/
    LTK_LCD_WriteReg(LCD_REG_80H, 0x0000);
    LTK_LCD_WriteReg(LCD_REG_81H, 0x0000);
    LTK_LCD_WriteReg(LCD_REG_82H, 0x0000);
    LTK_LCD_WriteReg(LCD_REG_83H, 0x0000);
    LTK_LCD_WriteReg(LCD_REG_84H, 0x0000);
    LTK_LCD_WriteReg(LCD_REG_85H, 0x0000);
    /* Panel Control ---------------------------------------------------------*/
    LTK_LCD_WriteReg(LCD_REG_90H, 0x0010);
    LTK_LCD_WriteReg(LCD_REG_92H, 0x0000);
    LTK_LCD_WriteReg(LCD_REG_93H, 0x0003);
    LTK_LCD_WriteReg(LCD_REG_95H, 0x0110);
    LTK_LCD_WriteReg(LCD_REG_97H, 0x0000);
    LTK_LCD_WriteReg(LCD_REG_98H, 0x0000);
    /* Set GRAM write direction and BGR = 1 */
    /* I/D=01 (Horizontal : increment, Vertical : decrement) */
    /* AM=1 (address is updated in vertical writing direction) */
    LTK_LCD_WriteReg(LCD_REG_03H, (1<<12)|(3<<4)|(0<<3));
    LTK_LCD_WriteReg(LCD_REG_07H, 0x0173); /* 262K color and display ON */
}

/**
  * @brief  initialize panel.
  * @param  None.
  * @retval None
  */
void LTK_HX8347A_Init()
{   
    //=========Initial HX8347  for INL2.8"QVGA Panel======// 
    LTK_SysTick_Delay(10); // Delay 1ms 
    LTK_SysTick_Delay(10); // Delay 10ms  
    LTK_SysTick_Delay(150); // Delay 150 ms 

    LTK_LCD_WriteReg(LCD_REG_42H,0x0008);   
    //Gamma setting  
    LTK_LCD_WriteReg(LCD_REG_46H,0x00B4); 
    LTK_LCD_WriteReg(LCD_REG_47H,0x0043); 
    LTK_LCD_WriteReg(LCD_REG_48H,0x0013); 
    LTK_LCD_WriteReg(LCD_REG_49H,0x0047); 
    LTK_LCD_WriteReg(LCD_REG_4AH,0x0014); 
    LTK_LCD_WriteReg(LCD_REG_4BH,0x0036); 
    LTK_LCD_WriteReg(LCD_REG_4CH,0x0003); 
    LTK_LCD_WriteReg(LCD_REG_4DH,0x0046); 
    LTK_LCD_WriteReg(LCD_REG_4EH,0x0005);  
    LTK_LCD_WriteReg(LCD_REG_4FH,0x0010);  
    LTK_LCD_WriteReg(LCD_REG_50H,0x0008);  
    LTK_LCD_WriteReg(LCD_REG_51H,0x000a);  

    //Window Setting 
    LTK_LCD_WriteReg(LCD_REG_02H,0x0000); 
    LTK_LCD_WriteReg(LCD_REG_03H,0x0000); 
    LTK_LCD_WriteReg(LCD_REG_04H,0x0000); 
    LTK_LCD_WriteReg(LCD_REG_05H,0x00EF); 
    LTK_LCD_WriteReg(LCD_REG_06H,0x0000); 
    LTK_LCD_WriteReg(LCD_REG_07H,0x0000); 
    LTK_LCD_WriteReg(LCD_REG_08H,0x0001); 
    LTK_LCD_WriteReg(LCD_REG_09H,0x003F); 

    LTK_SysTick_Delay(10); 

    LTK_LCD_WriteReg(LCD_REG_01H,0x0006); 
    LTK_LCD_WriteReg(LCD_REG_16H,0x00C8);   
    LTK_LCD_WriteReg(LCD_REG_23H,0x0095); 
    LTK_LCD_WriteReg(LCD_REG_24H,0x0095); 
    LTK_LCD_WriteReg(LCD_REG_25H,0x00FF); 
    LTK_LCD_WriteReg(LCD_REG_27H,0x0002); 
    LTK_LCD_WriteReg(LCD_REG_28H,0x0002); 
    LTK_LCD_WriteReg(LCD_REG_29H,0x0002); 
    LTK_LCD_WriteReg(LCD_REG_2AH,0x0002); 
    LTK_LCD_WriteReg(LCD_REG_2CH,0x0002); 
    LTK_LCD_WriteReg(LCD_REG_2DH,0x0002); 

    LTK_LCD_WriteReg(LCD_REG_3AH,0x0001);  
    LTK_LCD_WriteReg(LCD_REG_3BH,0x0001);  
    LTK_LCD_WriteReg(LCD_REG_3CH,0x00F0);    
    LTK_LCD_WriteReg(LCD_REG_3DH,0x0000); 

    LTK_SysTick_Delay(20); 

    LTK_LCD_WriteReg(LCD_REG_35H,0x0038); 
    LTK_LCD_WriteReg(LCD_REG_36H,0x0078); 
    LTK_LCD_WriteReg(LCD_REG_3EH,0x0038); 
    LTK_LCD_WriteReg(LCD_REG_40H,0x000F); 
    LTK_LCD_WriteReg(LCD_REG_41H,0x00F0);  

    LTK_LCD_WriteReg(LCD_REG_38H,0x0000); 

    // Power Setting 
    LTK_LCD_WriteReg(LCD_REG_19H,0x0049);  
    LTK_LCD_WriteReg(LCD_REG_93H,0x000A); 

    LTK_SysTick_Delay(10); 

    LTK_LCD_WriteReg(LCD_REG_20H,0x0020);   
    LTK_LCD_WriteReg(LCD_REG_1DH,0x0003);   
    LTK_LCD_WriteReg(LCD_REG_1EH,0x0000);  

    LTK_LCD_WriteReg(LCD_REG_1FH,0x0009);   

    LTK_LCD_WriteReg(LCD_REG_44H,0x0053);  
    LTK_LCD_WriteReg(LCD_REG_45H,0x0010);   


    LTK_SysTick_Delay(10);  

    LTK_LCD_WriteReg(LCD_REG_1CH,0x0004);  

    LTK_SysTick_Delay(20); 

    LTK_LCD_WriteReg(LCD_REG_43H,0x0080);    

    LTK_SysTick_Delay(5); 

    LTK_LCD_WriteReg(LCD_REG_1BH,0x000a);    

    LTK_SysTick_Delay(40);  

    LTK_LCD_WriteReg(LCD_REG_1BH,0x0012);    

    LTK_SysTick_Delay(40);   
    //Display On Setting 

    LTK_LCD_WriteReg(LCD_REG_90H,0x007F); 
    LTK_LCD_WriteReg(LCD_REG_26H,0x0004); 

    LTK_SysTick_Delay(40);  

    LTK_LCD_WriteReg(LCD_REG_26H,0x0024); 
    LTK_LCD_WriteReg(LCD_REG_26H,0x002C); 

    LTK_SysTick_Delay(40);   
    LTK_LCD_WriteReg(LCD_REG_70H,0x0008); 
    LTK_LCD_WriteReg(LCD_REG_26H,0x003C);  
    LTK_LCD_WriteReg(LCD_REG_57H,0x0002); 
    LTK_LCD_WriteReg(LCD_REG_55H,0x0000); 
    LTK_LCD_WriteReg(LCD_REG_57H,0x0000);
 }


/**
  * @brief  initialize panel.
  * @param  None.
  * @retval None
  */
void LTK_LGD4535_Init(void)
{                 
    LTK_LCD_WriteReg(0X15,0X0030);   
    LTK_LCD_WriteReg(0X9A,0X0010);   
    LTK_LCD_WriteReg(0X11,0X0020);   
    LTK_LCD_WriteReg(0X10,0X3428);   
    LTK_LCD_WriteReg(0X12,0X0002);   
    LTK_LCD_WriteReg(0X13,0X1038);   
    LTK_SysTick_Delay(40);   
    LTK_LCD_WriteReg(0X12,0X0012);   
    LTK_SysTick_Delay(40);   
    LTK_LCD_WriteReg(0X10,0X3420);   
    LTK_LCD_WriteReg(0X13,0X3038);   
    LTK_SysTick_Delay(70);   
    LTK_LCD_WriteReg(0X30,0X0000);   
    LTK_LCD_WriteReg(0X31,0X0402);   
    LTK_LCD_WriteReg(0X32,0X0307);   
    LTK_LCD_WriteReg(0X33,0X0304);   
    LTK_LCD_WriteReg(0X34,0X0004);   
    LTK_LCD_WriteReg(0X35,0X0401);   
    LTK_LCD_WriteReg(0X36,0X0707);   
    LTK_LCD_WriteReg(0X37,0X0305);   
    LTK_LCD_WriteReg(0X38,0X0610);   
    LTK_LCD_WriteReg(0X39,0X0610); 
      
    LTK_LCD_WriteReg(0X01,0X0100);   
    LTK_LCD_WriteReg(0X02,0X0300);   
    LTK_LCD_WriteReg(0X03,0X1030);  
    LTK_LCD_WriteReg(0X08,0X0808);   
    LTK_LCD_WriteReg(0X0A,0X0008);   
    LTK_LCD_WriteReg(0X60,0X2700);   
    LTK_LCD_WriteReg(0X61,0X0001);   
    LTK_LCD_WriteReg(0X90,0X013E);   
    LTK_LCD_WriteReg(0X92,0X0100);   
    LTK_LCD_WriteReg(0X93,0X0100);   
    LTK_LCD_WriteReg(0XA0,0X3000);   
    LTK_LCD_WriteReg(0XA3,0X0010);   
    LTK_LCD_WriteReg(0X07,0X0001);   
    LTK_LCD_WriteReg(0X07,0X0021);   
    LTK_LCD_WriteReg(0X07,0X0023);   
    LTK_LCD_WriteReg(0X07,0X0033);   
    LTK_LCD_WriteReg(0X07,0X0133);   
}

/**
  * @brief  initialize panel.
  * @param  None.
  * @retval None
  */
void LTK_SPFD5408_Init()
{
    LTK_LCD_WriteReg(LCD_REG_01H,0x0100);                                
    LTK_LCD_WriteReg(LCD_REG_02H,0x0700); //LCD Driving Waveform Contral 
    LTK_LCD_WriteReg(LCD_REG_03H,0x1030); //Entry Mode setting    
    LTK_LCD_WriteReg(LCD_REG_04H,0x0000); //Scalling Control register     
    LTK_LCD_WriteReg(LCD_REG_08H,0x0207); //Display Control 2 
    LTK_LCD_WriteReg(LCD_REG_09H,0x0000); //Display Control 3   
    LTK_LCD_WriteReg(LCD_REG_0AH,0x0000); //Frame Cycle Control     
    LTK_LCD_WriteReg(LCD_REG_0CH,0x0000); //External Display Interface Control 1 
    LTK_LCD_WriteReg(LCD_REG_0DH,0x0000); //Frame Maker Position        
    LTK_LCD_WriteReg(LCD_REG_0FH,0x0000); //External Display Interface Control 2 
    LTK_SysTick_Delay(20);
    LTK_LCD_WriteReg(LCD_REG_10H,0x16B0); //0x14B0 //Power Control 1
    LTK_LCD_WriteReg(LCD_REG_11H,0x0001); //0x0007 //Power Control 2
    LTK_LCD_WriteReg(LCD_REG_17H,0x0001); //0x0000 //Power Control 3
    LTK_LCD_WriteReg(LCD_REG_12H,0x0138); //0x013B //Power Control 4
    LTK_LCD_WriteReg(LCD_REG_13H,0x0800); //0x0800 //Power Control 5
    LTK_LCD_WriteReg(LCD_REG_29H,0x0009); //NVM read data 2
    LTK_LCD_WriteReg(LCD_REG_2AH,0x0009); //NVM read data 3
    LTK_LCD_WriteReg(LCD_REG_A4H,0x0000);   
    LTK_LCD_WriteReg(LCD_REG_50H,0x0000); //Horizontal GRAM Start Address
    LTK_LCD_WriteReg(LCD_REG_51H,0x00EF); //Horizontal GRAM End Address
    LTK_LCD_WriteReg(LCD_REG_52H,0x0000); //Vertical GRAM Start Address
    LTK_LCD_WriteReg(LCD_REG_53H,0x013F); //Vertical GRAM End Address
    LTK_LCD_WriteReg(LCD_REG_60H,0x2700); //Driver Output Control
    LTK_LCD_WriteReg(LCD_REG_61H,0x0001); //Driver Output Control
    LTK_LCD_WriteReg(LCD_REG_6AH,0x0000); //Vertical Scroll Control
    LTK_LCD_WriteReg(LCD_REG_80H,0x0000); //Display Position 每 Partial Display 1
    LTK_LCD_WriteReg(LCD_REG_81H,0x0000); //RAM Address Start 每 Partial Display 1
    LTK_LCD_WriteReg(LCD_REG_82H,0x0000); //RAM address End - Partial Display 1
    LTK_LCD_WriteReg(LCD_REG_83H,0x0000); //Display Position 每 Partial Display 2
    LTK_LCD_WriteReg(LCD_REG_84H,0x0000); //RAM Address Start 每 Partial Display 2
    LTK_LCD_WriteReg(LCD_REG_85H,0x0000); //RAM address End 每 Partail Display2
    LTK_LCD_WriteReg(LCD_REG_90H,0x0013); //Frame Cycle Control
    LTK_LCD_WriteReg(LCD_REG_92H,0x0000); //Panel Interface Control 2
    LTK_LCD_WriteReg(LCD_REG_93H,0x0003); //Panel Interface control 3
    LTK_LCD_WriteReg(LCD_REG_95H,0x0110); //Frame Cycle Control
    LTK_LCD_WriteReg(LCD_REG_07H,0x0173);       
    LTK_SysTick_Delay(50);
}

/**
  * @brief  Get the ID of the LCD controller.
  * @param  None
  * @retval The ID of the LCD controller
  */
uint16_t LTK_LCD_ID_Check()
{
    uint16_t DeviceCode = 0xFFFF;
    LTK_SysTick_Delay(100); /* delay 100 ms */
    DeviceCode = LTK_LCD_ReadReg(LCD_REG_00H); 
    if((DeviceCode != 0x9320) && (DeviceCode != 0x9325) && 
       (DeviceCode != 0x9328) && (DeviceCode != 0x5408))
    {
        LTK_SysTick_Delay(100); /* delay 100 ms */
        DeviceCode = LTK_LCD_ReadReg(LCD_REG_67H); 
    }
    return DeviceCode;
}

/**
  * @brief  Initialize LCD.
  * @param  None
  * @retval None
  */
void LTK_LCD_Init(void)
{
    uint16_t DeviceCode;
    LTK_LCD_Struct_Init();
    LTK_LCD_RCC_Init();
    LTK_LCD_GPIO_Init();
    DeviceCode = LTK_LCD_ID_Check(); 

    printf("LCD Device ID: 0x%X\n", DeviceCode);
    
    if(DeviceCode == 0x4531)
    {
        LTK_LCD_Param.LCD_Type = LCD_LGDP4531;
        LTK_LGDP4531_Init();
    }
    else if(DeviceCode == 0x9325 || DeviceCode == 0x9328)
    {
        LTK_LCD_Param.LCD_Type = LCD_ILI9325;
        LTK_ILI9325_Init();
    }
    else if(DeviceCode == 0x9320)
    {
        LTK_LCD_Param.LCD_Type = LCD_ILI9320;
        LTK_ILI9320_Init();
    }
    else if(DeviceCode == 0x5408)
    {
        LTK_LCD_Param.LCD_Type = LCD_SPFD5408;
        LTK_SPFD5408_Init();
    }
    else if(DeviceCode == 0x4535)
    {
        LTK_LCD_Param.LCD_Type = LCD_LGDP4535;
        LTK_LGD4535_Init();
    }
    else if(DeviceCode == 0x47)
    {
        LTK_LCD_Param.LCD_Type = LCD_HX8347A;
        LTK_HX8347A_Init();
    }
    
    LTK_LCD_BackLightSwitch(LCD_BACKLIGHT_OFF);
}

/**
  * @}
  */

/**
  * @}
  */
  
/**
  * @}
  */  
    
/****************************** leitek.taobao.com *****************************/
